Repository: OpenChain-KWG/Curriculum-Translation-KR
Catalog: openchain-curriculum-kr-level1.tmx
Source language: en_us
Languages: ko

source: Performing Reviews
ko: 리뷰 수행

source: Performing reviews
ko: 리뷰 수행

source: Permissive FOSS Licenses
ko: Permissive FOSS 라이선스

source: Permissive FOSS license: a term used often to describe minimally restrictive FOSS licenses
ko: Permissive FOSS 라이선스: 제한이 최소한인 FOSS 라이선스를 설명하기 위해 자주 사용되는 용어

source: Perpetual or time limited duration
ko: 영구적 또는 시간 제한 기간

source: Possible previous approvals in another context
ko: 다른 상황에서 있었던 이전의 승인

source: Post publication
ko: 공개 후 확인

source: Pre-Distribution Verifications
ko: 배포 전 확인

source: Pre-distribution verifications
ko: 배포 전 확인

source: Pre-loaded onto hardware
ko: 하드웨어에 프리로드됨

source: Prepare appropriate notices for any FOSS used in a product release:
ko: 제품 출시에 사용되는 FOSS에 대한 적절한 고지를 준비하십시오.

source: Preserve audit report findings and mark resolved issues as ready for the next step (i.e. Approval)
ko: 검사 보고서 결과를 보존하고 해결된 문제에 다음 단계(승인)를 위해 준비가 되었다고 표시합니다.

source: Product Manager
ko: 제품 관리자

source: Program Manager
ko: 프로그램 관리자

source: Proprietary
ko: 독점

source: Proprietary License or Closed Source
ko: 독점 라이선스 또는 폐쇄 소스

source: Proprietary licenses are unique to each vendor – there are as many variations of proprietary licenses as there are vendors and each must be evaluated individually
ko: 독점 라이선스는 각 공급 업체마다 고유함 – 공급 업체와 동일한 수의 다양한 독점 라이선스가 존재하며 각각은 개별적으로 평가되어야함

source: Protects expression (not the underlying idea)
ko: 표현을 보호(기본 아이디어가 아님)

source: Provide accompanying source code along with any associated build tools and documentation (e.g., by uploading to a distribution website or including in the distribution package)
ko: 수반되는 소스 코드를 관련 빌드 도구 및 문서와 함께 제공하십시오 (예: 배포 사이트에 업로드하거나 배포 패키지에 포함).

source: Provide accompanying source code as required
ko: 필요에 따라 동봉하는 소스 코드를 제공하십시오.

source: Provide feedback to the appropriate engineers to resolve issues in the audit report that conflict with your FOSS policy
ko: FOSS 정책과 충돌하는 검사 보고서내의 문제를 해결하기 위해 적절한 엔지니어에게 피드백을 제공하십시오.

source: Provide guidance compatible with company policy and business objectives
ko: 회사 정책 및 비지니스 목표와 호환 가능한 가이드 제공

source: Publish source code,
ko: 소스 코드 공개,고지 및 서면 약정 제공

source: Queued for Process
ko: 프로세스 대기중

source: Record approved
ko: 각 제품 및 릴리즈별 승인된 소프트웨어/버전 기록

source: Registration
ko: 등록

source: Registration / Approval Tracking
ko: 등록 / 승인 추적

source: Registration/approval tracking
ko: 추적 등록 / 승인

source: Released under CC0-1.0.You may use, modify, and share these slides without restriction.They also come with no warranty.
ko: CC0-1.0에 따라 발표되었습니다.제한없이 이 슬라이드를 사용, 수정 및 공유할 수 있습니다.또한 보증이 적용되지 않습니다.

source: Relevant terms include:
ko: 관련 용어는 다음과 같습니다.:

source: Reproduce the entire text of the license agreements for the FOSS code included in the product as needed
ko: 필요에 따라 제품에 포함된 FOSS 코드에 대한 라이선스 계약서의 전체 텍스트를 복사합니다.

source: Resolve Issues
ko: 문제 해결

source: Resolve all issues identified in the audit
ko: 검사에서 확인된 모든 문제를 해결하십시오.

source: Resolve any
ko: 회사 FOSS 정책에 따라 검사 문제 해결

source: Resolving Issues
ko: 문제 해결

source: Resolving issues
ko: 문제 해결

source: Review and Approve all FOSS components used
ko: 사용된 모든 FOSS 컴포넌트 리뷰 및 승인합니다.

source: Review and approve
ko: FOSS 컴포넌트의 컴플라이언스 기록 리뷰 및 승인

source: Review and approve any outbound contributions to FOSS projects
ko: FOSS 프로젝트로의 기여에 대해 리뷰 및 승인합니다.

source: Review the resolved issues to confirm it matches your FOSS policy
ko: 해결된 문제를 리뷰하여 FOSS 정책과 일치하는지 확인합니다.

source: Reviews
ko: 리뷰

source: Running a FOSS Review
ko: FOSS 리뷰 실행

source: Scan or audit source code
ko: 스캔 또는 소스 코드 검사

source: Scanning
ko: 스캐닝

source: Scanning and tooling teams that identify and track FOSS usage.
ko: FOSS 사용을 식별하고 추적하는 스캐닝 및 도구 운영 팀.

source: Scans of the software
ko: 소프트웨어 스캔

source: Shareware – proprietary software provided to users on a trial basis,for a limited time, free of charge and with limited functionalities or features
ko: 셰어웨어 – 제한된 시간 동안 제한된 기능을 사용자에게 시범적으로 무료 제공하는 독점 소프트웨어

source: Small companies may use a simple checklist and enterprises a detailed process.
ko: 소규모 업체는 간단한 체크리스트를, 기업들은 상세한 절차를 사용할 수 있습니다.

source: Software is protected by copyright
ko: 소프트웨어는 저작권의 보호를 받음

source: Some licenses require that if derivative works (or software in the same file, same program or other boundary) are distributed, the distribution is under the same terms as the original work
ko: 일부 라이선스는 파생 저작물(또는 동일한 파일, 동일한 프로그램 또는 다른 경계의 소프트웨어)이 배포되는 경우 원본 저작물과 동일한 조건으로 배포 할 것을 요구

source: Sometimes a FOSS usage scenario may not be clear to the FOSS review team.
ko: 때로는 FOSS 사용 시나리오가 FOSS 리뷰팀에게 명확하지 않을 수도 있습니다.

source: Source Code Scanning Tools
ko: 소스 코드 스캐닝 도구

source: Source code delivery
ko: 소스 코드 전달

source: Source code for the audit is identified
ko: 검사를 위한 소스 코드가 식별됩니다.

source: Source code scanning and tooling support to help identify and track FOSS usage
ko: FOSS 사용을 식별하고 추적할 수 있는 소스 코드 스캐닝 및 도구 지원

source: Source may be scanned by a software tool
ko: 소스는 소프트웨어 도구로 스캔할 수도 있습니다.

source: Specialists
ko: 전문가

source: Static/Dynamic Linking
ko: 정적/동적 링킹

source: Status of the community around the package (activity, diverse membership, responsiveness)
ko: 패키지를 제공하는 커뮤니티의 상태 (활기, 다양한 회원, 반응성)

source: Steps:
ko: 단계:

source: Such actions often include:
ko: 이러한 활동에는 주로 다음이 포함됩니다.:

source: Support Requirements:
ko: 지원 요구사항:

source: The BSD license is an example of a permissive license that allows unlimited redistribution for any purpose in source or object code form as long as its copyright notices and the license's disclaimers of warranty are maintained
ko: BSD 라이선스는 저작권 표시 및 라이선스 면책 조항이 유지되는한 어떠한 목적으로든 소스 코드 또는 오브젝트 코드 형식으로 무제한 재배포를 허용하는 Permissive 라이선스의 한 예임

source: The FOSS Review is a basic building block of a FOSS Compliance Program.
ko: FOSS 리뷰는 FOSS 컴플라이언스 프로그램의 기본 구성 요소입니다.

source: The FOSS Review process crosses disciplines, including engineering, business, and legal teams.
ko: FOSS 리뷰 프로세스는 엔지니어링, 비지니스, 법무팀을 비롯한 여러 분야를 포함합니다.

source: The FOSS Review process includes the following steps:
ko: FOSS 리뷰 프로세스에는 다음 단계가 포함됩니다:

source: The FOSS Review process should be flexible enough to allow the interested parties to collaborate.
ko: FOSS 리뷰 프로세스는 이해 관계자가 협업 할 수있도록 충분히 유연해야합니다.

source: The FOSS Review process should have executive oversight to resolve disagreements and approve the most important decisions.
ko: FOSS 리뷰 프로세스는 의견 불일치를 해결하고 가장 중요한 결정을 승인할 수 있는 경령진의 감독을 받아야 합니다.

source: The FOSS Review process should have oversight (for example, an Executive Review Committee in this diagram).
ko: FOSS 리뷰 프로세스에는 감독이 있어야합니다 (예 :이 다이어그램의 경영진 리뷰 위원회).

source: The FOSS Review team may consist of an interdisciplinary team
ko: FOSS 리뷰팀은 하나의 연합된 팀으로 구성될 수 있습니다.

source: The FOSS Review team should assess the information it has gathered before providing guidance for issues.
ko: FOSS 리뷰 팀은 문제에 대한 가이드를 제공하기 전에 수집한 정보를 평가해야합니다.

source: The FOSS Review team should consider:
ko: FOSS 리뷰 팀은 다음을 고려해야합니다.

source: The FOSS Review team should have the expertise to properly assess the FOSS usage. This may require support from engineering teams to educate legal and business teams about the proposed FOSS usage.
ko: FOSS 리뷰팀은 FOSS 사용을 적절히 평가할 수있는 전문 지식을 갖추고 있어야합니다. 이는 제안된 FOSS사용에 대해 법률 및 비즈니스팀을 교육하기 위해 엔지니어링 팀의 지원이 필요할 수 있습니다.

source: The OpenChain Curriculum supports the Specification by providingfreely available training material.
ko: OpenChain 교육과정은 자유롭게 사용할 수있는 교육 자료를 제공함으로 설명서를 지원합니다.

source: The OpenChain Project helps to identify and share the core componentsof a Free and Open Source Software (FOSS) compliance program.
ko: OpenChain 프로젝트는 FOSS(Free and Open Source Software) Compliance 프로그램의 핵심 구성 요소를 식별하고 공유하는데 도움이됩니다.

source: The appropriate engineers then conduct FOSS Reviews on the relevant source code (see next slide for template)
ko: 그러면 엔지니어는 관련 소스 코드에 대한 FOSS 리뷰를 수행합니다. (다음 슬라이드의 템플릿 참조)

source: The approval and its conditions should be registered in a tracking system
ko: 승인 및 이에 대한 조건은 추적 시스템에 등록해야 합니다.

source: The approval should specify versions of approved FOSS components, the approved usage model for the component, and any other applicable obligations under the FOSS license
ko: 승인에서는 승인된 FOSS 컴포넌트의 버전, 컴포넌트의 승인된 사용 모델 및 FOSS 라이선스 하의 기타 해당되는 모든 의무 사항을 명시해야 합니다.

source: The copyright notices, attribution and source code normally helps to identify who is licensing the FOSS software.
ko: 저작권 고지, 귀속에 대한 고지 및 소스 코드가 일반적으로 FOSS 소프트웨어의 라이선스를 부여하는 사람을 식별하는 데 도움이됩니다.

source: The copyright owner only has control over the work that he or she created, not someone else’s independent creation
ko: 저작권 소유자는 자신이 만든 저작물에 대해서만 통제권을 가지며, 타인의 독립적인 저작물은 해당하지 않음

source: The core of the OpenChain Project is the Specification.
ko: OpenChain 프로젝트의 핵심은 설명서입니다.

source: The distribution package contains only software that has been reviewed and approved
ko: 배포 패키지에는 리뷰 및 승인된 소프트웨어만 포함됩니다.

source: The engineering team will need the ability to provide further input.
ko: 엔지니어 팀은 더 많은 정보를 제공 할 수있는 능력이 필요할 것입니다.

source: The first step is to identify the proper parties to initiate a FOSS Review
ko: 첫 번째 단계는 FOSS 리뷰를 시작하기에 적합한 당사자를 식별하는 것입니다.

source: The goal of shareware is to give potential buyers the opportunity to use the program and judge its usefulness before purchasing a license for the full version of the software
ko: 셰어웨어의 목표는 잠재적인 구매자에게 프로그램의 전체 버전에 대한 라이선스를 구입하기 전에 프로그램을 사용하고 그 유용성을 판단 할 기회를 제공하는 것

source: The legal team may be supported by others, including:
ko: 다음을 포함하여 다른 사람들이 법률팀을 지원할 수 있습니다:

source: The legal team, which may include in-house or outside attorneys, reviews and evaluates the FOSS usage for license obligations
ko: 사내 또는 외부 변호사를 포함 할 수있는 법무팀이 라이선스 의무에 대한 FOSS 사용을 검토 및 평가합니다.

source: The license can be limited to:
ko: 라이선스는 다음 사항에 제한될 수 있음:

source: The license can have conditions on the grants, meaning you only getthe license if you comply with certain obligations
ko: 라이센스에는 부여를 위한 조건이 있을 수 있음이는 특정 의무를 준수하는 경우에만 라이선스를 취득한다는 의미임

source: The license contains a clause restricting use of the names of contributors for endorsement of a derived work without specific permission
ko: 특정 허가 없이 파생 저작물을 추천하기 위해 기여자 이름의 사용을 제한하는 조항이 포함되어 있음

source: The method for initiating this process may vary by company, but should be open to those who are involved in using FOSS in development.
ko: 이 프로세스를 시작하는 방법은 회사마다 다를 수 있지만 개발 과정에서 FOSS를 사용하는 사람들에게 개방되어 있어야합니다.

source: The next few slides explain these concepts in more detail.
ko: 다음 슬라이드에서는 이러한 개념을 보다 자세히 설명합니다.

source: The origins and licenses of the source code
ko: 소스 코드의 출처와 라이선스

source: The oversight committee may make important policy decisions or resolve disagreements between parties in the review process.
ko: 감독위원회는 중요한 정책 결정을 내릴 수도 있고 검토 과정에서 당사자 간의 불일치를 해결할 수도 있습니다.

source: The package name, version, download URL, license, description and intended use in your product is a good starting point.
ko: 패키지 이름, 버전, 다운로드 URL, 라이선스, 설명 및 제품에서의 사용 목적이 올바른 시작점입니다.

source: The precisely level of detail you will need depends on your organization and intended use case.
ko: 필요한 정밀도 수준은 조직 및 사용 목적에 따라 달라집니다.

source: The process should be flexible enough so that FOSS users in your organization have access to guidance.
ko: 프로세스는 조직 내의 FOSS 사용자가 가이드에 접근 할 수 있도록 충분히 유연해야합니다.

source: The right to distribute
ko: 배포할 권리

source: The right to reproduce the software – making copies
ko: 소프트웨어를 복제 할 권리 – 복사하기

source: The right to create “derivative works” – making modifications
ko: “ 파생 저작물”을 만들 권리 – 수정하기

source: The source code may or may not be available, and creation of derivative works is usually restricted
ko: 소스 코드가 사용 가능하거나 사용 가능하지 않을 수 있으며, 파생 저작물 생성은 일반적으로 제한됨

source: The teams may also organize and track information gathered regarding FOSS usage to assist with later compliance processes.
ko: 이 팀은 이후의 컴플라이언스 프로세스를 지원하기 위해 FOSS 사용과 관련하여 수집된 정보를 구성하고 추적 할 수도 있습니다.

source: The term derivative work comes from the US Copyright Act
ko: 파생 저작물이라는 용어는 미국 저작권법에서 비롯됨

source: The tracking system should make it clear that a new approval is needed for a new version of a FOSS component or if a new usage model is proposed
ko: 추적 시스템은 새로운 버전의 FOSS 컴포넌트이거나 새로운 사용 모델이 제안되는 경우는 새로운 승인이 필요하다는 점을 명확히 해야 합니다.

source: There are a couple additional issues in the case of external vendors.
ko: 외부 공급 업체의 경우 몇 가지 추가 문제가 있습니다.

source: There are many different automated source code scanning tools.
ko: 다양한 자동화된 소스 코드 스캐닝 도구가 있습니다.

source: These representatives may include:
ko: 대표자에는 다음이 포함 될 수 있습니다 :

source: These slides follow US law.
ko: 이 슬라이드는 미국 법률을 따릅니다.

source: These slides help companies satisfy the requirements of the Specification Section 1.2.
ko: 이 슬라이드는 회사들이 설명서 1.2의 요구 사항을 충족하는 데 도움이됩니다.

source: These teams may provide support using code scanning or forensics tools to identify FOSS components in a codebase.
ko: 이 팀은 코드 스캔 또는 포렌식(forensics)도구를 사용하여 코드베이스의 FOSS 컴포넌트를 식별하는데 도움을 제공 할 수 있습니다.

source: They can also be used for general compliance training.
ko: 또한, 일반 Compliance 교육에도 사용할 수 있습니다.

source: This chapter describes a “FOSS Review” process in which FOSS usage is analyzed and the relevant obligations are determined
ko: 이 장에서는 FOSS 사용을 분석하고 관련 의무를 결정하는 "FOSS 리뷰" 프로세스에 대해 설명합니다.

source: This chapter will focus on copyright and patents,the areas most relevant to FOSS compliance.
ko: 이 장에서는 FOSS Compliance와 가장 관련이있는 분야인,저작권 및 특허권에 초점을 맞추어 설명합니다.

source: This identifies and publishes the core requirements a FOSS compliance program should satisfy.
ko: 이는 FOSS Compliance 프로그램이 만족해야하는 핵심 요구 사항을 식별하고 공개합니다.

source: This is referred to as a “copyleft” or “reciprocal” effect
ko: 이를 "Copyleft" 또는 "상호주의" 효과라고 함

source: This may include scanning the code to confirm the accuracy of the information.
ko: 여기에는 정보의 정확성을 확인하기 위해 코드를 스캔하는 작업이 포함될 수 있습니다.

source: This may include:
ko: 여기에는 다음이 포함될 수 있습니다:

source: This process is where a company can analyze the FOSS software it uses and understand its rights and obligations
ko: 이 프로세스를 통해 회사가 사용하는 FOSS 소프트웨어를 분석하고 권리와 의무를 이해할 수 있습니다.

source: This process may be assisted by support teams, including teams that run code scanning tools to scan for undisclosed FOSS usage.
ko: 이 프로세스는 코드 스캐닝 도구를 실행하여 알려지지 않은 FOSS 사용을 검색하는 팀을 포함하는 지원팀의 도움을 받을 수 있습니다.

source: This slide explains some of the concepts behind distribution.
ko: 이 슬라이드는 배포의 기본 개념을 설명합니다.

source: This slide explains the big picture of what Open Source code scanning tools are, how they work, and where a new user can start to gather knowledge about the subject.
ko: 이 슬라이드는 오픈 소스 코드 스캐닝 도구가 무엇인지, 어떻게 작동하는지, 새로운 사용자가 이 주제에 대한 지식을 어디에서 수집 할 수 있는지에 대한 큰 그림을 설명합니다.

source: This slide is about how the use of FOSS components is a consideration for your compliance.
ko: 이 슬라이드는 FOSS 컴포넌트를 사용하면서 컴플라이언스를 위해 고려해야 할 사항에 관한 것입니다.

source: This slides explains that development tools may do some of these actions “behind the scene”, and this is an area that companies should be aware of.
ko: 이 슬라이드는 개발 도구가 "내부적으로" 이러한 작업 중 일부를 수행할 수 있음을 설명합니다. 이것은 기업이 알아야 할 영역입니다.

source: This slides outlines what incorporation means when using FOSS.
ko: 이 슬라이드는 FOSS를 사용할 때 결합의 의미를 설명합니다.

source: This slides outlines what linking means when using FOSS.
ko: 이 슬라이드는 FOSS를 사용할 때 링킹의 의미를 설명합니다.

source: This slides outlines what modification means when using FOSS.
ko: 이 슬라이드는 FOSS를 사용할 때 수정의 의미를 설명합니다.

source: This slides outlines what translation means when using FOSS.
ko: 이 슬라이드는 FOSS를 사용할 때 번역의 의미를 설명합니다.

source: To gather and analyze information regarding FOSS usage and to produce appropriate guidance.
ko: FOSS 사용에 관한 정보를 수집 및 분석하고 적절한 가이드를 작성하는 것입니다.

source: Track progress of all FOSS compliance activities
ko: 모든 FOSS 컴플라이언스 활동의 진행 사항을 추적합니다.

source: Trade secrets: protects valuable confidential information
ko: 영업 비밀: 중요한 기밀 정보 보호

source: Trademarks: protects marks (word, logos, slogans, color, etc.) that identifythe source of the product
ko: 상표 : 제품의 출처를 식별하는 표시(단어, 로고, 슬로건, 색상 등)를 보호

source: Translate the material
ko: 자료 번역

source: Translating Chinese to English
ko: 중국어를 영어로 번역

source: Translation
ko: 번역

source: Translation is when you transform the code from one state to another.
ko: 번역은 코드를 한 상태에서 다른 상태로 변환하는 것입니다.

source: Types of use allowed (commercial / non-commercial, distribution, derivative works / to make, have made, manufacture)
ko: 허용된 사용 유형 (상업적 / 비상업적, 배포, 파생 저작물 / 제조, 제조?, 제조?))

source: User Space
ko: 사용자 영역

source: Utilizing
ko: 활용 (Utilizing)

source: Validate compliance with license obligations
ko: 라이선스 의무 준수 확인

source: Verification
ko: 확인

source: Verifications
ko: 확인

source: Verified Distributed Compliance Artifacts are appropriately provided
ko: 확인된 배포할 컴플라이언스 결과물이 적절하게 제공됩니다.

source: Verify FOSS packages destined for distribution have been identified and approved
ko: 배포할 FOSS 패키지가 식별되고 승인되었는지 확인하십시오.

source: Verify accompanying source code (if any) has been uploaded or distributed correctly
ko: 수반되는 소스 코드가 (있을 경우) 올바르게 업로드 되었는지 또는 배포되었는지 확인하십시오.

source: Verify all appropriate notices have been included to inform end-users of their right to request source code for identified FOSS
ko: 최종 사용자에게 식별된 FOSS에 대한 소스 코드를 요청할 수 있는 권리를 알리기 위한 모든 적절한 고지 사항이 포함되어 있는지 확인하십시오.

source: Verify appropriate notices are provided
ko: 적절한 고지가 제공되는지 확인

source: Verify compliance with other identified obligations
ko: 식별된 다른 의무를 준수하는지 확인하십시오.

source: Verify notices have been properly published and made available
ko: 고지가 올바르게 게시되고 사용 가능하게 되었는지 확인하십시오.

source: Verify other identified obligations are met
ko: 기타 식별된 의무가 충족되었는지 확인하십시오.

source: Verify source code packages for distribution
ko: 배포용 소스 코드 패키지 확인

source: Verify that distributed software has been reviewed and approved
ko: 배포되는 소프트웨어가 리뷰되고 승인되었는지 확인하십시오.

source: Verify the information necessary to satisfy FOSS obligations
ko: FOSS 의무를 이행하는데 필요한 정보를 확인합니다.

source: Verify the reviewed source code matches the binary equivalents shipping in the product
ko: 리뷰된 소스 코드가 제품에 들어있는 바이너리와 일치하는지 확인하십시오.

source: Verify uploaded or distributed source code corresponds to the same version that was approved
ko: 업로드되거나 배포된 소스 코드가 승인된 것과 동일한 버전인지 확인하십시오.

source: Version
ko: 버전

source: What additional information is important when reviewing a FOSS component from an outside vendor?
ko: 외부 공급 업체로부터의 FOSS 구성 요소를 검토 할 때 중요한 추가 정보는 무엇입니까?

source: What copyright rights are most important for software?
ko: 소프트웨어에 대해 가장 중요한 저작권 권한은 무엇입니까?

source: What does an architecture review look for?
ko: 아키텍처 리뷰는 무엇을 찾기 위한 것입니까?

source: What factors are important in assessing a distribution?
ko: 배포인지를 평가하는데 중요한 요소는 무엇입니까?

source: What format for delivery?
ko: 어떤 형태로 전달됩니까?

source: What information do you need to gather?
ko: 어떤 정보를 수집해야합니까?

source: What information helps identify who is licensing the software?
ko: 누가 소프트웨어 라이선스를 부여했는지 식별하는데 도움이되는 정보는 무엇입니까?

source: What is Intellectual Property?
ko: 지적 재산권이란 무엇입니까?

source: What is incorporation?
ko: 결합이란 무엇입니까?

source: What is involved in compliance due diligence (for our example process, describe the steps at a high level)?
ko: 컴플라이언스 실사 (Due Diligence)에 필요한 것은 무엇입니까 (예로든 프로세스에서 높은 수준에서의 단계를 설명하세요)?

source: What is linking?
ko: 링킹이란 무엇입니까?

source: What is modification?
ko: 수정이란 무엇입니까?

source: What is the OpenChain Curriculum?
ko: OpenChain 교육과정이란 무엇입니까?

source: What is the first action you should take if you want to use FOSS components?
ko: FOSS 컴포넌트를 사용하고자 할 때 취해야 할 첫 번째 액션은 무엇입니까?

source: What is the format for delivery?
ko: 전달하는 형태는 무엇입니까?

source: What is the purpose of a FOSS Review?
ko: FOSS 리뷰의 목적은 무엇입니까?

source: What is translation?
ko: 번역이란 무엇입니까?

source: What is “Intellectual Property”?
ko: "지적 재산권"이란 무엇입니까?

source: What kinds of information might you collect for a FOSS review?
ko: FOSS 리뷰를 위해 어떤 종류의 정보를 수집할 수 있습니까?

source: What rights does a patent give to the patent owner?
ko: 특허가 특허 소유자에게 부여하는 권리는 무엇입니까?

source: What should you do if you have a question about using FOSS?
ko: FOSS 사용에 관한 질문이 있으면 무엇을 해야합니까?

source: What steps can be taken to assess the quality of information collected in a FOSS Review?
ko: FOSS 리뷰에서 수집한 정보의 품질을 평가하기 위해 어떤 단계를 수행할 수 있습니까?

source: What type of material does copyright law protect?
ko: 저작권법은 어떤 유형의 자료를 보호합니까?

source: When analyzing FOSS usage, collect information about the identity of the FOSS component, its origin, and how the FOSS component will be used.
ko: FOSS 사용을 분석할 때, FOSS 컴포넌트의 정체, 출처 및 FOSS 컴포넌트가 어떻게 사용될지에 대한 정보를 수집하십시오.

source: When thinking about distribution of Open Source you should consider to things:
ko: 오픈소스의 배포에 대해 생각할때 다음 사항을 고려해야 합니다.

source: Who are the decision makers about FOSS usage (managers, architects, individual engineers, etc.)?
ko: FOSS 사용에 대한 의사 결정자는 누구입니까 (관리자, 아키텍트, 개별 엔지니어 등)?

source: Who receives the software?
ko: 누가 소프트웨어를 받습니까?

source: Work
ko: 작업

source: Working through the FOSS Review
ko: FOSS 리뷰를 통한 작업

source: Written Offer
ko: 서면 청약

source: You can get an example FOSS policy via the Linux FoundationOpen Compliance Program at:https://www.linux.com/publications/generic-foss-policy
ko: Linux Foundation Open Compliance Program에서 예제 FOSS 정책을 얻을 수 있습니다. :https://www.linux.com/publications/generic-foss-policy

source: You can get detailed checklists for these items here: https://www.linuxfoundation.org/projects/opencompliance/self-assessment-compliance-checklist
ko: 이 항목에 대한 자세한 체크리스트는 여기서 받을 수 있습니다: https://www.linuxfoundation.org/projects/opencompliance/self-assessment-compliance-checklist

source: You may also want to obtain copyright and attribution notices, and source code for vendor modifications if these are needed to satisfy license obligations for FOSS licenses governing the third party software.
ko: 또한 외부 공급 업체의 소프트웨어에 적용된 FOSS 라이선스에 대한 라이선스 의무를 충족하기 위해 필요한 경우, 저작권 및 귀속에 관한 고지, 공급 업체의 수정 소스 코드를 얻을 수 있습니다.

source: You must cause any work that you distribute or publish, that in whole or in part containsor is derived from the Program or any part thereof, to be licensed […] under the termsof this License.
ko: 배포하거나 공표하려는 저작물의 전부 또는 일부가 양도 받은 프로그램의 일부를 포함하거나 프로그램으로부터 파생된 것이라면, 저작물에 대한 사용권리를 본 라이선스의 규정에 따라 […] 허용해야 한다.

source: [Insert Components]
ko: [컴포넌트 추가]

source: [Insert interaction method]
ko: [상호작용 방법 추가]

source: identification
ko: 식별

source: – and –
ko: – 그리고 –

source: “Hits” from the audit or scan are reviewed and verified as to the proper origin of the code
ko: 검사 또는 스캔을 통한 "히트 (Hits)"가 리뷰되고 코드의 적절한 출처에 대해 확인됩니다.
